---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToReplaceWithLink
source: html/e3d9eeb7-f89a-eb2c-ee42-f89835722dd5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToReplaceWithLink Property

Selected elements were copied to new file but Revit was unable to replace them with link to that file.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToReplaceWithLink { get; }
```